console.log("Hello, World! This is the first homework of the Front End PRO course.");

console.clear("Очищает консоль");

console.error("Метод служит для вывода сообщения об ошибке.");

console.count("Служит для просмотра сколько раз эта строка вызывалась с заданной меткой.");
console.count("Служит для просмотра сколько раз эта строка вызывалась с заданной меткой.");
console.count("Служит для просмотра сколько раз эта строка вызывалась с заданной меткой.");

console.info("Информативная регистрация информации.");

console.warn("Выводит предупреждающее сообщение.");