//Узнать как в конце убрать запятую
//1.Вывести на страницу в одну строку через запятую числа от 10 до 20
/**let b = 10; 
let msg = '';
while (b <= 20) {
  msg+= b++  + ', ';  
}
console.log(msg);**/

//2.Вывести квадраты чисел от 10 до 20




//3.Вывести таблицу умножения на 7

/**let output = '';
for (let e = 7; e <= 7; e++) {
  for (let k = 1; k <= 10; k++) {
    output += ' ' + e * k;
    if (e * k < 7) {
      output += ' ';
    }
  }
  console.log(output);
  output = '';
}


//4.Найти сумму всех целых чисел от 1 до 15

let sum = 1;
for (let d = 1; d <= 15; d++) {
  sum += d;
}
console.log(sum);


//7. Вывести на страницу сумму только четных чисел в диапазоне от 30 до 80



//10.Напечатать полную таблицу умножения от 1 до 10

let output = '';
for (let a = 1; a <= 9; a++) {
  for (let j = 1; j <= 9; j++) {
    output += ' ' + a * j;
    if (a * j < 10) {
      output += ' ';
    }
  }
  console.log(output);
  output = '';
} 


**/